---
kind: enumMember
id: F:Autodesk.Revit.DB.AssemblyDetailViewOrientation.DetailSectionB
enum: Autodesk.Revit.DB.AssemblyDetailViewOrientation
source: html/941c2468-0a94-b2c0-0c73-1953e15487d6.htm
---
# Autodesk.Revit.DB.AssemblyDetailViewOrientation.DetailSectionB

The Detail View will be oriented vertically, looking west.